나 취 했어
나 취 했어

아 *땀*이 난다
내가 *uh 금단*인 것처럼
*자이트레의 작은 손*
*비메네 급강하처럼*

난 *그냥 코 풀고*
잠시 *진정*
*Chum 나에게 당신에게서 기차를 줘*
그리고 난 다시 기분이 좋아

나 취 했어
너와 함께 기분이 너무 좋아
난 너무 *ghypet*
너와 함께 기분이 좋아
내가 밤새 널 깨뜨린다는 걸 알잖아
나를 그렇게 중독되게 만들고 싶니?
너무 높다
나 취 했어

*최소 심박수 경주*
너무 많은 아드레날린
*오픈차트 게임*
나는 엔돌핀을 끊는다

난 너와만 느껴
*내가 모든 것을 찬 것처럼*
*당신에게로 가게 해주세요*
*곧 다시 할 수 있을 거예요*

나 취 했어
너와 함께 기분이 너무 좋아
난 너무 흥분해
너와 함께 기분이 좋아
내가 밤새 널 깨뜨린다는 걸 알잖아
나를 그렇게 중독되게 만들고 싶니?
너무 높다
나 취 했어

높은
나 취 했어

나 취 했어
너와 함께 기분이 너무 좋아
난 너무 흥분해
너와 함께 기분이 좋아
내가 밤새 널 깨뜨린다는 걸 알잖아
나를 그렇게 중독되게 만들고 싶니?

너무 높다
나 취 했어
